<?php

/*
//Создайте переменную с именем x и присвойте ей значение "Hello World"
//Task 1
$x = "Hello World";

echo $x;
*/

/////////////////////////////////

/*
//Создайте одну переменную с именем x и вторую переменную y, а затем с помощью echo выведите сумму x и y.
//Task 2 
$x = 5;
$y = 7;

echo $x + $y;
*/

////////////////////////////////

/*
//Найдите длину строки «Привет мир!» и выведите с помощью echo
//Task 3
$str = 'Привет мир!';

//echo strlen($str);// количество байт
echo $x = iconv_strlen($str, 'UTF-8');//количество символов в кодировке UTF-8
*/

////////////////////////////////

/*
//Замените слово "HTML" словом "PHP".
//Task 4
$oldText = "Learn HTML!";

echo str_replace("HTML","PHP",$oldText);
*/

////////////////////////////////

/*
//Выведите строку "x больше y" если переменная $x > $y.
//Task 5
$x = 50;
$y = 10;

if ($x > $y) echo "x больше y";

////////////////////////////////

/*
//Выведите строку "Первый" если $a равно $b, выведите "Второй" если $a > $b, в противном случае выведите "Третий".
//Task 6
$a = 20;
$b = 10;

if ($a == $b) {
    echo "Первый";
}
elseif($a > $b) {
    echo "Второй";
}
else {
    echo "Третий";
}
*/

////////////////////////////////

/*
//Выведите строку "Hello" если $color «red», выведите "Второй" если $color «green». Воспользуйтесь switch.
//Task 7

$color = 'green';
switch($color) {
    case "red": 
          echo "Hello"; 
          break;
    case "green": 
          echo "Второй"; 
          break;
}
*/

